fun main() {

}

/** 3 Принципа функционального программирования
 * 1)Функции как полноценные объекты - с функциями (элементами поведения) можно работать как со значениями.
 * Их можно хранить в переменных, передавать в аргументах или возвращать из других функций.
 * 2)Неизменяемость - программные объекты никогда не изменяются,что гарантирует неизменность их состояния после создания.
 * Это решает проблемы многопоточности.
 * 3)Отсутствие побочных эффектов - функции всегда возвращают один и тот же результат для тех же аргументов, не изменяют состояние
 * других объектов и не взаимодействуют с окружающим миром.
 * */