package data_structures.heap

/**
 *  Внешне напоминает BinarySearch tree.
 *  Ключевоя характеристика этой структуры в том, что она всегда complete.
 *  В отличие от Tree Heap не может иметь дубликатов. https://umbrellait.rapira.com/sNr8yp
 *  Heap всегда отсортирована по убыванию или возрастанию.
 *  Все наследники определенного нода должны быть больше или меньше своего родителя.
 *
 *  Все это дерево в итоге хранится в ArrayList, начиная с индекса 0 или 1. Есть несколько вариантов. https://umbrellait.rapira.com/T1ghbz
 *
 *
 *  todo Перенести все крлы скринов на свой диск.
 * */
fun main(){

}