package data_structures.graph


/**
 * Граф это структура данных, состоящая из вершин (узлов) и мостов между ними. Мосты так же как и вершины имеют числовые значения (длина)
 * С помощью графа удобно моделировать устройство сети интернет или социальную сеть. Мосты могут иметь длину, а могут не иметь.
 * Дерево это ограниченная форма графа. Каждый следующий Node может указывать на ограниченное число других.
 * Так же LinkedList это форма дерева. Но когда мы говорим о графах то представляем нечто похожее на это https://umbrellait.rapira.com/ZygwIH
 *
 * Из теории графов нужно знать что они бывают симметричные и ассиметричные (возможно тут ошибаюсь). Конкретно эти свойства устанавливаются по
 * матрице в которую можно конвертировать граф. Есть связь - будет 1. Если нет то 0. Как это делается показано вот тут https://www.udemy.com/course/data-structures-and-algorithms-java/learn/lecture/29629648#learning-tools
 * Помимо этих свойств у графов существуют и другие.
 * Так же граф можно представить в виде Списка.
 * */
fun main(){

}