package design.patterns.creational

/**
 * Креационные шаблоны (Creational Patterns)
 * Креационные шаблоны проектирования решают задачи, связанные с созданием объектов.
 * Они помогают изолировать код создания объектов от остальной части программы,
 * позволяя улучшить гибкость и удобство управления созданием объектов.
 * Эти шаблоны позволяют выбирать наиболее подходящий способ создания объектов в зависимости от ситуации.
 *
 * Основные креационные шаблоны:
 * Singleton (Одиночка) — гарантирует, что класс имеет только один экземпляр, и предоставляет глобальную точку доступа к этому экземпляру.
 * Factory Method (Фабричный метод) — позволяет создавать объекты, не указывая конкретный класс создаваемого объекта.
 * Abstract Factory (Абстрактная фабрика) — предоставляет интерфейс для создания семейств взаимосвязанных объектов, не уточняя их конкретные классы.
 * Builder (Строитель) — отделяет конструкцию сложного объекта от его представления, чтобы тот же процесс строительства мог создавать разные представления объектов.
 * Prototype (Прототип) — позволяет создавать новые объекты, копируя существующие экземпляры, что полезно для создания объектов с идентичными характеристиками.
 * */