package design.patterns.strctural

/**
 * 2. Структурные шаблоны (Structural Patterns)
 * Структурные шаблоны проектирования решают задачи, связанные с композицией объектов и организацией их взаимосвязей. Эти шаблоны помогают упростить создание более сложных структур, используя существующие объекты.
 *
 * Основные структурные шаблоны:
 * Adapter (Адаптер) — позволяет совместить два несовместимых интерфейса, преобразуя один интерфейс в другой, который ожидает клиент.
 * Bridge (Мост) — разделяет абстракцию и её реализацию, чтобы их можно было изменять независимо.
 * Composite (Композит) — позволяет сгруппировать объекты в древовидные структуры, представляя части и целое одинаково.
 * Decorator (Декоратор) — добавляет новое поведение объектам, оборачивая их в другие объекты, не изменяя их структуру.
 * Facade (Фасад) — предоставляет простой интерфейс для сложной подсистемы, скрывая её детали от клиента.
 * Flyweight (Приспособленец) — уменьшает количество создаваемых объектов, повторно используя уже созданные объекты для идентичных данных.
 * Proxy (Заместитель) — предоставляет суррогатный объект, который контролирует доступ к другому объекту, обычно для контроля доступа, ленивой загрузки или защиты.
 * */